/***************************************************************************
 *	@ファイル名		:	07_Terunet.c
 *	@概要		:	Terunet
 *
 *					必要な処理はコメントの先頭に**がついていますので，
 *					必ず記入するようにしてください．
 *	@バージョン		:	2.0.0
 *	@開発者		:	キネクト
 *	@使用環境		:	STM32F4DISCOVERY, MB_Ver3, MB_Ver4, Coocox CoIDE
 **************************************************************************/

#include "example.h"

#ifdef __07_TERUNET__

/******************************/
/* ↓↓　以下がサンプル　↓↓ */
/******************************/
#include <stm32f4xx.h>	// **最初にインクルードする
#include "terunet.h"
#include "timer.h"
#include "rs485_master.h"

int main(void)
{
	/* -------------	変数宣言	----------------- */
	u8 recv[10];
	int tmp = 50;
	/* ---------------------------------------------- */

	/* -----------------	初期化	----------------- */
	SystemCoreClockUpdate();	// **最初に呼び出す
	TIM7_CMT_Init();
	Terunet_Init(TERUNET_BAUDRATE);

	/* ---------------------------------------------- */

	/* -------------	メインループ	------------- */
	while(1)
	{
		tmp = 50 - tmp;
		RS485_fastMotor_Drive_LPC2(0, tmp, recv);
		delay_ms(100);
	}
	/* ---------------------------------------------- */

	return 0;
}
/******************************/
/* ↑↑　以上がサンプル　↑↑ */
/******************************/

#endif /* __07_TERUNET__ */
